//////////////////////////////////////////////////////////////////////////////// 
// 
// step2.cpp - Математика
// 
// 1. Пересечь прямые                      - Intersect2Line
// 2. Пересечь кривые                      - Intersect2Curve
// 3. Пересечь отрезок и дугу              - IntersectLineSegArc
// 4. Касательная из точки                 - TanLinePointCircle
// 5. Касательная под углом                - TanLineAngCircle
// 6. Поворот точки                        - RotatePoint
// 7. Симметрия точки                      - SymmetryPoint
// 8. Сопрягающие окружности к двум прямым - Couplin2Lines
// 9. Перепендикуляр                       - Perpendicular
// 
//////////////////////////////////////////////////////////////////////////////// 
#include "stdafx.h"
#include <afxdllx.h> 
#include "resource.h"

#include <libtool.h>
#include <ldefin2d.h>
#include <ksConstants.h>


#ifdef _DEBUG
#define new DEBUG_NEW
#undef THIS_FILE
static char THIS_FILE[] = __FILE__;
#endif


//-------------------------------------------------------------------------------
// Специальная структура используемая в течении инициализации DLL
// ---
static AFX_EXTENSION_MODULE StepDLL = { NULL, NULL };


//-------------------------------------------------------------------------------
// Стандартная точка входа
// Инициализация и завершение DLL
// ---
extern "C" int APIENTRY
DllMain( HINSTANCE hInstance, DWORD dwReason, LPVOID lpReserved )
{
  UNREFERENCED_PARAMETER( lpReserved );

  if ( dwReason == DLL_PROCESS_ATTACH )
  {
    TRACE0( "DLL Initializing!" );
 
    if ( !AfxInitExtensionModule( StepDLL, hInstance ) )
      return 0;

    new CDynLinkLibrary( StepDLL );
  }
  else if ( dwReason == DLL_PROCESS_DETACH )
  {
    TRACE0( "DLL Terminating!" );
    AfxTermExtensionModule( StepDLL );
  }
  return 1;
}


//-------------------------------------------------------------------------------
//
// ---
CString LoadStr( int strID )
{
  TCHAR temp[_MAX_PATH];
  ::ksConvertLangStrExT( ::StepDLL.hModule, strID, temp,
    _MAX_PATH );

  return temp;
}


//-------------------------------------------------------------------------------
// Определить имя библиотеки
// ---
LPWSTR WINAPI LIBRARYNAMEW()
{
  static wchar_t temp[_MAX_PATH];
  ::LoadStringW( ::StepDLL.hModule, IDR_LIBID, temp, _MAX_PATH );
  return temp;
}


//-------------------------------------------------------------------------------
// Отображаемое имя библиотеки
// ---
LPWSTR WINAPI DisplayLibraryNameW()
{
  static wchar_t temp[_MAX_PATH];
  ::LoadStringW( ::StepDLL.hModule, IDR_LIBDIS, temp, _MAX_PATH );
  return temp;
}


//-------------------------------------------------------------------------------
// Задать идентификатор ресурсов
// ---
unsigned int WINAPI LIBRARYID()
{
  return IDR_LIBID;
}


//-------------------------------------------------------------------------------
// Получить идентификаторы инструментальных и компактных панелей
// ---
int WINAPI LibToolBarId( int barType, // Тип запрашиваемой панелей ( 0 - компактная панель, 1 - простая инструментальная панель ) 
                         int index )  // Индекс панели
{
	if ( !barType )
    return !index ? COMPACT_BAR1 : -1;
	else 
		return -1; 
}

//-----------------------------------------------------------------------------
// Получить начало диапазона иконок для команд библиотеки
// ---
int WINAPI LibraryBmpBeginID( unsigned int bmpSizeType )
{
  int res = 0;
  switch ( bmpSizeType )
  {
    case ksBmp1616: res = 1000; break;
    case ksBmp2424: res = 2000; break;
    case ksBmp3232: res = 3000; break;
	  case ksBmp4848: res = 4000; break;
  }
  return res;
}


//-------------------------------------------------------------------------------
// Состояние команды
// ---
int WINAPI LibCommandState( unsigned int comm, int * enable, int * checked )
{
  if ( enable )
  {
    int type = ksGetDocumentType( 0 ); 
    *enable = type == lt_DocSheetStandart || type == lt_DocFragment || type == lt_DocSheetUser || type == lt_DocSpc || type == lt_DocSpcUser; // Команды доступны в 2D документе
  }
  return 0;
}


//-------------------------------------------------------------------------------
// Описания используемых функций
// ---
void Intersect2Line();
void Intersect2Curve();
void IntersectLineSegArc();
void TanLinePointCircle();
void TanLineAngCircle();
void RotatePoint();
void SymmetryPoint();
void Couplin2Lines();
void Perpendicular();


//-------------------------------------------------------------------------------
// Головная функция библиотеки
// ---
void WINAPI LIBRARYENTRY( unsigned int comm )
{
  if ( ksGetCurrentDocument( 1 ) ) // Получить активный 2D документ
  {
    switch ( comm )
    {
      case 1 : Intersect2Line();      break; // Пересечь прямые
      case 2 : Intersect2Curve();     break; // Пересечь кривые
      case 3 : IntersectLineSegArc(); break; // Пересечь отрезок и дугу
      case 4 : TanLinePointCircle();  break; // Касательная из точки
      case 5 : TanLineAngCircle();    break; // Касательная под углом
      case 6 : RotatePoint();         break; // Поворот точки
      case 7 : SymmetryPoint();       break; // Симметрия точки
      case 8 : Couplin2Lines();       break; // Сопрягающие окружности к двум прямым
      case 9 : Perpendicular();       break; // Перепендикуляр
    }
  }
  else
    Message( "Документ не активизирован или\nне является листом/фрагментом" );
}


//-------------------------------------------------------------------------------
// Пересечь прямые
// ---
void Intersect2Line()
{
  // Отрисовка прямых
  Line( 10, 10, 0  );
  Line( 15, 5,  90 );

  int count;   // Количество пересечений
  double x, y; // Точка пересечения
 
  // Получить координаты точки пересечения двух прямых
  IntersectLinLin( 10, 10,   // Точка на первой прямой
                   0,        // Угол первой прямой
                   15, 5,    // Точка на второй прямой
                   90,       // Угол второй прямой
                   &count,   // Количество точек пересечения
                   &x, &y ); // Точка пересечения

  // Отрисовка точки пересечения
  if ( count )
    Point( x, y, 0 );

  // Результат пересечения
  char buf[255];
  sprintf_s( buf, "count = %d, x = %4.2f, y = %4.2f", count, x, y );
  Message( buf );
}


//-------------------------------------------------------------------------------
// Пересечь кривые
// ---
void Intersect2Curve()
{
  Bezier( 0, 0 ); // Создание кривой Безье
    Point( 0,  10, 0 ); // Точки входящие в кривую Безье
    Point( 10, 20, 0 );
    Point( 20, 10, 0 );
    Point( 10, 0,  0 );
    Point( 0,  10, 0 );
  reference rBezier1 = EndObj(); // Функция EndObj возвращает указатель на созданный объект кривой Безье

  Mtr( 0, 10, 0, 1 ); // Матрица преобразования координат ( 10 по оси OY )
    Bezier( 0, 0 );   
      Point( 0,  10, 0 ); // Точки входящие в кривую Безье
      Point( 10, 20, 0 );
      Point( 20, 10, 0 );
      Point( 10, 0,  0 );
      Point( 0,  10, 0 );
    reference rBezier2 = EndObj(); 
  DeleteMtr(); // Отключение матрицы преобразования координат
 
  int count;         // Количество пересечений
  double x[2], y[2]; // Массивы точек пересечения

  // Пересечение 2-х кривых, могут быть геометрические объекты: отрезки, 
  // окружности, дуги, эллипсы, кривые, контуры, эквидистанты, макробъекты
  IntersectCurvCurv( rBezier1, // Указатели на геометрические объекты
                     rBezier2, 
                     &count,   // Количество точек пересечения
                     x, y,     // Массивы точек пересечения
                     2 );      // Максимальное число выдаваемых точек пересечений

  // Отрисовка точек пересечения
  for ( int i = 0; i < count; i++ )
    Point( x[i], y[i], 0 );
 
  // Результат пересечения
  TCHAR buf[255];
  _stprintf_s( buf, _T("count = %d, x[0] = %4.2f, y[0] = %4.2f, x[1] = %4.2f, y[1] = %4.2f"), 
           count, x[0], y[0], x[1], y[1] );
  MessageT( buf );
}


//-------------------------------------------------------------------------------
// Пересечь отрезок и дугу
// ---
void IntersectLineSegArc()
{
  // Отрисовка отрезка
  LineSeg( 0, 40, 100, 40, 1 );

  // Отрисовка дуги по центру и конечным точкам
  ArcByPoint( 50, 40, 20, 30, 40, 70, 40, 1, 1 );

  int count;         // Количество пересечений
  double x[2], y[2]; // Массивы точек пересечения

  // Получить координаты точек пересечения отрезка и дуги
  IntersectLinSArc( 0,   40,                 // Первая точка отрезка
                    100, 40,                 // Вторая точка отрезка
                    50,  40,                 // Центр дуги
                    20,                      // Радиус дуги
                    Angle( 50, 40, 30, 40 ), // Начальный и конечный угол дуги
                    Angle( 50, 40, 70, 40 ), 
                    1,                       // Направление дуги
                    &count,                  // Количество точек пересечения
                    x, y );                  // Массивы точек пересечения

  // Отрисовка точек пересечения
  for ( int i = 0; i < count; i++ )
    Point( x[i], y[i], 0 );

  // Результат пересечения
  TCHAR buf[255];
  _stprintf_s( buf, _T("count = %d, x[0] = %4.2f, y[0] = %4.2f, x[1] = %4.2f, y[1] = %4.2f"), 
           count, x[0], y[0], x[1], y[1] );
  MessageT( buf );
}


//-------------------------------------------------------------------------------
// Касательная из точки
// ---
void TanLinePointCircle()
{
  // Отрисовка точки
  Point( 10, 50, 0 );
 
  // Отрисовка окружности
  Circle( 50, 10, 40, 1 );

  int count;         // Число касательных
  double x[2], y[2]; // Массивы точек касания
 
  // Получить точки касания окружности и прямой, проходящей через заданную точку
  TanLinePointCircle( 10, 50,      // Координаты внешней точки
                      50, 10, 40,  // Координаты центра и радиус окружности
                      &count,      // Число касательных
                      x, y );      // Массивы точек касания

  // Отрисовка точек касания и касательных
  for ( int i = 0; i < count; i++ )
  {
    Point( x[i], y[i], 0 );
    Line( 10, 50, Angle( 10, 50, x[i], y[i] ) );
  }

  // Результат касания
  TCHAR buf[255];
  _stprintf_s( buf, _T("count = %d, x[0] = %4.2f, y[0] = %4.2f, x[1] = %4.2f, y[1] = %4.2f"), 
           count, x[0], y[0], x[1], y[1] );
  MessageT( buf );
}


//-------------------------------------------------------------------------------
// Касательная под углом
// ---
void TanLineAngCircle()
{
  // Отрисовка отрезка
  LineSeg( 0, 40, 100, 40, 1 );
 
  // Отрисовка окружности
  Circle( 50, 10, 40, 1 );

  double x[2], y[2]; // Точка касания
 
  // Получить точки касания окружности и прямой, проходящей под заданным углом
  TanLineAngCircle( 50, 10, 40, // Координаты центра и радиус окружности
                    45,         // Угол касательной прямой
                    x, y );   // Точка касания
 
  // Отрисовка точки касания и касательной
  Point( x[0], y[0], 0 );
  Line( x[0], y[0], 45 );

  // Результат касания
  TCHAR buf[255];
  _stprintf_s( buf, _T("x = %4.2f, y = %4.2f"), x[0], y[0] );
  MessageT( buf );
}


//-------------------------------------------------------------------------------
// Поворот точки
// ---
void RotatePoint()
{
  // Отрисовка точки
  Point( 60, 50, 0 );

  // Отрисовка точки
  Point( 50, 50, 1 );

  double x, y; // Результат поворота точки

  // Поворот точки относительно центра
  Rotate( 60, 50,   // Координаты точки
          50, 50,   // Координаты центра
          180,      // Угол поворота
          &x, &y ); // Результат поворота

  // Отрисовка результирующей точки
  Point( x, y, 2 );
 
  // Результат поворота
  TCHAR buf[255];
  _stprintf_s( buf, _T("x = %4.2f, y = %4.2f"), x, y );
  MessageT( buf );
}


//-------------------------------------------------------------------------------
// Симметрия точки
// ---
void SymmetryPoint()
{
  // Отрисовка точки
  Point( 55, 60, 0 );

  // Отрисовка отрезка
  LineSeg( 60, 50, 50, 50, 1 );

  double x, y; // Результат симметрии точки

  // Получить координаты точки, симметричной относительно заданной оси
  Symmetry( 55, 60,   // Координаты точки
            60, 50,   // Начальная точка оси
            50, 50,   // Конечная точка оси
            &x, &y ); // Результат симметрии
 
  // Отрисовка результирующей точки
  Point( x, y, 1 );
 
  // Результат симметрии
  TCHAR buf[255];
  _stprintf_s( buf, _T("x = %4.2f, y = %4.2f"), x, y );
  MessageT( buf );
}


//-------------------------------------------------------------------------------
// Сопрягающие окружности к двум прямым
// ---
void Couplin2Lines()
{
  // Отрисовка прямых
  Line( 100, 100, 45 );
  Line( 100, 100, -45 );

  double rad = 20; // Радиус сопряжения
  int count;       // Число сопряжений
  CON con[4];      // Массив данных по каждому сопряжению ( структура CON включает:
                   // центр сопрягающей окружности, координаты точки сопряжения ) 
 
  // Получить параметры окружностей, касательной к двум прямым
  CouplingLineLine( 100, 100, 45,  // Первая прямая
                    100, 100, -45, // Вторая прямая
                    rad,           // Радиус сопряжения
                    &count,        // Число сопряжений
                    con );         // Массив данных по каждому сопряжению

  // Отрисовка сопрягающихся окружностей и точек касания
  for ( int i = 0; i < count; i++ )
  {
    Circle( con[i].xc, con[i].yc, rad, 2 );
    Point( con[i].x1, con[i].y1, i );
    Point( con[i].x2, con[i].y2, i );
  }

  // Результат сопряжения
  TCHAR buf[255];
  _stprintf_s( buf, _T("count = %d, con[0].x1 = %4.2f, con[0].y1 = %4.2f,\ncon[0].x2 = %4.2f, con[0].y2 = %4.2f ..."), 
           count, con[0].x1, con[0].y1, con[0].x2, con[0].y2 );
  MessageT( buf );
}


//-------------------------------------------------------------------------------
// Перепендикуляр
// ---
void Perpendicular()
{
  // Отрисовка точки
  Point( 50, 50, 0 );

  // Отрисовка отрезка
  LineSeg( 60, 10, 100, 10, 1 );

  double x, y; // Точка пересечения отрезка и перпендикуляра
 
  // Координаты точки пересечения отрезка и перпендикуляра
  Perpendicular( 50, 50,   // Координаты произвольной внешней точки
                 60, 10,   // Координаты первой точки отрезка
                 100, 10,  // Координаты второй точки отрезка
                 &x, &y ); // Координаты точки пересечения отрезка и перпендикуляра

  // Отрисовка точки пересечения отрезка и перпендикуляра
  Point( x, y, 1 );

  // Результат расчета перпендикуляра
  TCHAR buf[255];
  _stprintf_s( buf, _T("x = %4.3f, y = %4.3f"), x, y );
  MessageT( buf );
}
