//////////////////////////////////////////////////////////////////////////////// 
// 
// step4_1.cpp - Процессы Cursor и Placement
//
// Интерактивный ввод точки ( Placement - и угла  ) или определение варианта действия.
// Возможные варианты ( команды ) задаются в строке commands структуры RequestInfo
// и разделяются  восклицательными знаками или пробелами. Если вместо строки в
// качестве параметра передать идентификатор меню из файла ресурсов, то
// соответствующее меню будет выдано в окне приглашений. Если в качестве адреса
// callBack передается NULL, то действие функции прекращается после первого шага.
// 
//////////////////////////////////////////////////////////////////////////////// 
#include "stdafx.h"

#ifndef _INC_MATH
#include <math.h> 
#endif 

#ifndef __LIBTOOL_H
#include <libtool.h>
#endif

#ifdef _DEBUG
#define new DEBUG_NEW
#undef THIS_FILE
static char THIS_FILE[] = __FILE__;
#endif


int g_type = 1; // Глобальная переменная - тип текущей фигуры

extern ksAPI7::IApplicationPtr appl;
//-------------------------------------------------------------------------------
// Обновляется не только изображение но и меню для запроса
// ---
void Update( reference & rGroup,  // Группа
             RequestInfoT & info ) // Структура параметров запроса к системе
{
  // Группа для фантома должна быть временная и обновляться при изменении вида отрисовки
  if ( rGroup )
    DeleteObj( rGroup );
  
  // Создание группы объектов, type - тип группы ( 0 - определяет модельный, 1 - временный )
  rGroup = NewGroup( 1 );
  switch ( g_type )
  {
    case 0 :
      // Состав гуппы
      LineSeg( -10, 0,   10, 0,  1 );
      LineSeg(  10, 0,   10, 20, 1 );
      LineSeg(  10, 20, -10, 20, 1 );
      LineSeg( -10, 20, -10, 0,  1 );
      // Отображаемое меню
      info.commands = _T("!Окружность !Треугольник");
      break;

    case 1 :
      // Состав гуппы
      Circle( 0, 0, 20, 1 );
      // Отображаемое меню
      info.commands = _T("!Квадрат !Треугольник");
      break;
 
    case 2 :
      // Состав гуппы
      LineSeg( -10, 0,   10,  0,  1 );
      LineSeg(  10, 0,   0,   20, 1 );
      LineSeg(  0,  20, -10,  0,  1 );
      // Отображаемое меню
      info.commands = _T("!Окружность !Квадрат");
      break;
  }
  EndGroup(); // Завершить создание группы объектов
}


//-------------------------------------------------------------------------------
// Функция обратной связи, вызываемая из Cursor
// ---
int WINAPI CallBackC( int comm,             // Пришедшая команда
                      double *x, double *y, // Положение фантома
                      RequestInfoT *info,    // Структура параметров запроса к системе
                      void *phantom,        // Структура параметров фантома
                      int/*dynamic*/ )
{
  Phantom *pPhantom = ( Phantom * )phantom;
 
  // Выполнение команды
  if ( comm == -1 ) // Поставить в модель
  {
    // Сдвинуть и повернуть группу
    MoveObj( pPhantom->type1.gr, *x, *y );
    if ( fabs( pPhantom->type1.ang ) > 0.001 )
      RotateObj( pPhantom->type1.gr, *x, *y, pPhantom->type1.ang );
 
    // Поставить временную группу в вид
    StoreTmpGroup( pPhantom->type1.gr );
    // Очистить группу объектов
    ClearGroup( pPhantom->type1.gr );
  }
  else // Сменить тип фигуры
  {
    if ( ( g_type == 1 && comm == 1 ) || ( g_type == 2 && comm == 2 ) )
      g_type = 0;
    else
      g_type = comm;
  }

  // Обновляется не только изображение но и меню для запроса
  if ( info )
    Update( pPhantom->type1.gr, *info );

  return 1;
}


//------------------------------------------------------------------------------
// Функция обратной связи, вызываемая из Placement
// ---
int WINAPI CallBackP( int comm,             // Пришедшая команда
                      double *x, double *y, // Положение фантома
                      double *ang,          // Угол поворота фантома
                      RequestInfoT *info,    // Структура параметров запроса к системе
                      void *phantom,        // Структура параметров фантома
                      int )                 // Признак динамического запроса ( 1-динамический запрос, 0-статический )
{
  Phantom *pPhantom = ( Phantom * )phantom;
 
  // Выполнение команды
  if ( comm == -1 ) // Поставить в модель
  {
    // Сдвинуть и повернуть группу
    // Отличее от Cursor угол приходит в виде параметра функции
    MoveObj( pPhantom->type1.gr, *x, *y );
    if ( fabs( *ang ) > 0.001 )
      RotateObj( pPhantom->type1.gr, *x, *y, *ang );
 
    // Поставить временную группу в вид
    StoreTmpGroup( pPhantom->type1.gr );
    // Очистить группу объектов
    ClearGroup( pPhantom->type1.gr );
  }
  else // Сменить тип фигуры
  {
    if ( ( g_type == 1 && comm == 1 ) || ( g_type == 2 && comm == 2 ) )
      g_type = 0;
    else
      g_type = comm;
  }

  // Обновляется не только изображение но и меню для запроса
  if ( info )
    Update( pPhantom->type1.gr, *info );

  return 1;
}


//-------------------------------------------------------------------------------
// Пример с использованием Cursor и Placemant c обратными функциями
// ---
void DrawRectCallBack()
{
  Phantom phantom; // Структура параметров фантома
  
  phantom.phType      = 1; // Тип фантома ( type1, type2, ... type7 )
  phantom.type1.xBase = 0; // Координаты начальной точки группы
  phantom.type1.yBase = 0;
  phantom.type1.scale = 1; // Масштаб
  phantom.type1.gr    = 0; // Указатель на группу
  phantom.type1.ang   = 0; // Угол поворота группы 
 
  // Структура параметров запроса к системе
  RequestInfoT info;
  memset( &info, 0, sizeof( info ) );

  // Обновляется не только изображение, но и меню для запроса
  Update( phantom.type1.gr, info );

  // Координата вставки
  double x, y;

  // Пример с использованием Placemant
  // Указываем адрес обратной функции для Placement
  info.callBack = CallBackP;
  // Задание точки, угла или комманды
  PlacementExT( &info,              // Указатель на структуру параметров запроса к системе	
                &x, &y,             // Координаты введенной точки	
                &phantom.type1.ang, // Введенный угол
                &phantom, NULL );         // Указатель на структуру управления фантомом, определяющую тип	движения курсора

  /*
  // Пример с использованием Cursor
  // Указываем адрес обратной функции для Cursor
  info.callBack = CallBackC;
  // Ввод точки или комманды
  CursorExT( &info,            // Указатель на структуру параметров запроса к системе	 
             &x, &y,           // Координаты введенной точки	
             &phantom, NULL ); // Указатель на структуру управления фантомом, определяющую тип	движения курсора
  */
}


//-------------------------------------------------------------------------------
// Пример с использованием Cursor и Placemant без обратных функций
// Разцица от предыдущего примера состоит в том, что цикл организован не внутри
// функции Cursor или Plecemant а снаружи. При этом на экране при каждом
// новом витке цикла будет гаснуть и снова всплывать окно меню.
// ---
void DrawRectNULL()
{
  Phantom phantom; // Структура параметров фантома
  
  phantom.phType      = 1; // Тип фантома ( type1, type2, ... type7 )
  phantom.type1.xBase = 0; // Координаты начальной точки группы
  phantom.type1.yBase = 0;
  phantom.type1.scale = 1; // Масштаб
  phantom.type1.gr    = 0; // Указатель на группу
  phantom.type1.ang   = 0; // Угол поворота группы  
 
  // Структура параметров запроса к системе
  RequestInfoT info;
  memset( &info, 0, sizeof( info ) );

  // Координата вставки
  double x, y;

  int comm = 1; // Пришедшая команда
  while ( comm )
  {
    // Обновляется не только изображение, но и меню для запроса
    Update( phantom.type1.gr, info );

    // Пример с использованием Placemant
    // Задание точки, угла или комманды
    comm = PlacementExT( &info,              // Указатель на структуру параметров запроса к системе	
                         &x, &y,             // Координаты введенной точки	
                         &phantom.type1.ang, // Введенный угол
                         &phantom, NULL );         // Указатель на структуру управления фантомом, определяющую тип	движения курсора    

    /*
    // Пример с использованием Cursor
    // Ввод точки или комманды
    comm = CursorExT( &info,            // Указатель на структуру параметров запроса к системе	 
                      &x, &y,           // Координаты введенной точки	
                      &phantom, NULL ); // Указатель на структуру управления фантомом, определяющую тип	движения курсора
    */

    // Выполнение команды
    if ( comm == -1 ) // Поставить в модель
    {
      // Сдвинуть и повернуть группу
      MoveObj( phantom.type1.gr, x, y );
      if ( fabs( phantom.type1.ang ) > 0.001 )
        RotateObj( phantom.type1.gr, x, y, phantom.type1.ang );

      // Поставить временную группу в вид
      StoreTmpGroup( phantom.type1.gr );
      // Очистить группу объектов
      ClearGroup( phantom.type1.gr );
    }
    else // Сменить тип фигуры
    {
      if ( ( g_type == 1 && comm == 1 ) || ( g_type == 2 && comm == 2 ) )
        g_type = 0;
      else
        g_type = comm;
    }
  }
}




