//////////////////////////////////////////////////////////////////////////////// 
// 
// step11.cpp - Пример запроса командного окна
// 
////////////////////////////////////////////////////////////////////////////////
#include <vcl.h>
#pragma hdrstop

#include <tchar.h>

#include <stdio.h>

#include "libtool.h"
#include "step11.rh"

//------------------------------------------------------------------------------
// в Win32 линкуется SDK/lib/kAPI2D5bc.lib
// в x64 линкуется SDK/lib64/kAPI2D5bc.a
// ---
#pragma comment(lib, "kAPI2D5bc")

//-------------------------------------------------------------------------------
// Задать идентификатор ресурсов
// ---
extern "C" unsigned int __export __stdcall LIBRARYID()
{
  return IDR_LIBID;
}


//------------------------------------------------------------------------------
// Функция обратной связи
// ---
int far __export __stdcall CallBackCommand( int command, RequestInfoT *info  )
{
	static TCHAR buf[255];
	_stprintf( buf, _T("Выполняется команда %d"), command );
	MessageT( buf );

	// Заменяем заголовок окна в зависимости от выполненной команды
	// аналогично можно заменить и состав дерева команд
	_stprintf( buf, _T("Последняя выбранная команда %d"), command );
	info->title = buf;

	// Возвращаемый результат определяет, должна ли система продолжать запрашивать команду :
	// ( TRUE - продолжать, FALSE - завержить работу с окном )
	return command == ID_COMMAND_3 ? FALSE : TRUE;
}


//-------------------------------------------------------------------------------
// Головная функция библиотеки
// ---
extern "C" void __export __stdcall LIBRARYENTRY( unsigned int )
{
  // Обращаемся к системе с запросом на создание окна с деревом команд.
  // Если в качестве функции обратного вызова задан NULL, 
  // то управление из CommandWindow возвращается немедленно, 
  // как только пользователь выберет команду в дереве команд.
  // Прт этом возвращается идентификатор выбранной команды.
  // В противном случае управление вернется, если пользователь закроет окно
  // или функция обратного вызова вернет FALSE, при этом возвращается -1.
  
  // Структура параметров запроса к системе
	RequestInfoT info;
	memset( &info, 0, sizeof( info ) );
	info.commands = ( TCHAR * )ID_TREE_CONTENTS;  // Идентификатор меню с составом дерева команд
	info.title    = _T("Дерево команд");             // Заголовка окна команд
	info.callBack = CallBackCommand;             // Функции обратного вызова
 
  // Создание меню в диалоговом окне
	int command = CommandWindowT( &info );
	TCHAR buf[255];
	_stprintf( buf, _T("Результат выполнения ф-ии CommandWindow %d"), command );
	MessageT( buf );
}
