unit Step22;
//******************************************************************/
//*               (c)Акционерное общество АСКОН                    */
//*                Санкт-Петербург, 1991, 1996                     */
//*                 Компас-Мастер  версия 5.x                      */
//******************************************************************/
//*                    Библиотека примеров                         */
//*               использования математических функций             */
//*
//* 1. Пересечь прямые                      - Intersect2Line       */
//* 2. Пересечь кривые                      - Intersect2Curve      */
//* 3. Пересечь отрезок и дугу              - IntersectLineSegArc  */
//* 4. Касательная из точки                 - TanLinePointAndCircle*/
//* 5. Касательная под углом                - TanLineCircle        */
//* 6. Поворот точки                        - RotatePoint          */
//* 7. Симметрия точки                      - SymmetryPoint        */
//* 8. Сопрягающие окружности к двум прямым - Couplin2Lines        */
//* 9. Перепендикуляр                       - BuildPerpendicular   */
//*                                                                */
//******************************************************************/

interface

 procedure  LIBRARYENTRY( comm: WORD  ); Pascal;
 function   LIBRARYID   : Cardinal;      Pascal;
 function   LibToolBarId( barType : Integer; index : Integer ) : Integer; stdcall;

//-------------------------------------------------------------------------------
// Описания используемых функций
// ---
 procedure  Intersect2Line;
 procedure  Intersect2Curve;
 procedure  IntersectLineSegArc;
 procedure  TanLinePointAndCircle;
 procedure  TanLineCircle;
 procedure  RotatePoint;
 procedure  SymmetryPoint;
 procedure  Couplin2Lines;
 procedure  BuildPerpendicular;

implementation
 uses  Sysutils, LibTool, Ltdefine;

const
 IDR_LIBID    = 2000; // Идентификатор библиотеки
 COMPACT_BAR1 = 2001; // Идентификатор панели команд


//----------------------------------------------------------------------------------------
// Задать идентификатор ресурсов
//---
function   LIBRARYID : Cardinal;  pascal;
begin
  Result := IDR_LIBID;
end;

//----------------------------------------------------------------------------------------
// Головная функция библиотеки
//---
procedure  LIBRARYENTRY( comm : Word  );  pascal;
begin
  if ( ksGetCurrentDocument( 1 ) <> 0 ) then
    case comm of
      1: Intersect2Line;        //пересечь прямые
      2: Intersect2Curve;       //пересечь кривые
      3: IntersectLineSegArc;   //пересечь отрезок и дугу
      4: TanLinePointAndCircle; //касательная из точки
      5: TanLineCircle;         //касательная под углом
      6: RotatePoint;           //поворот точки
      7: SymmetryPoint;         //симметрия точки
      8: Couplin2Lines;         //сопрягающие окружности к двум прямым
      9: BuildPerpendicular;    //перепендикуляр
    end {case}
  else
    ksMessage( 'Документ не активизирован или' +#13#10+ 'не является листом/фрагментом' );

end;

//-------------------------------------------------------------------------------
// Получить идентификаторы инструментальных и компактных панелей
// ---
function LibToolBarId( barType : Integer; // Тип запрашиваемой панелей ( 0 - компактная панель, 1 - простая инструментальная панель )
                       index   : Integer ) : Integer; stdcall; // Индекс панели
begin
	if barType = 0 then
    if index = 0 then
      Result := COMPACT_BAR1
    else
     Result := -1
	else
		Result := -1;
end;

//----------------------------------------------------------------------------------------
//  пересечение прямых
//---
procedure Intersect2Line;
var
  count: Integer; // Количество пересечений
  x, y : Double;  // Точка пересечения
  buf  : AnsiString;  // Буфер для сообщения
begin
  // Отрисовка прямых
  Line( 10,10, 0 );
  Line( 15, 5, 90 );

  // Получить координаты точки пересечения двух прямых
  IntersectLinLin( 10, 10,   // Точка на первой прямой
                   0,        // Угол первой прямой
                   15, 5,    // Точка на второй прямой
                   90,       // Угол второй прямой
                   count,    // Количество точек пересечения
                   x, y );   // Точка пересечения

  // Точка пересечения
  if count > 0 then
    Point( x, y, 0 );

  // Результат пересечения
  buf := Format( 'count=%d xp=%6.2f yp=%6.2f ', [count, x, y ] );
  ksMessage( PAnsiChar(buf) );
end;

//----------------------------------------------------------------------------------------
// пересечь кривые
//---
procedure Intersect2Curve;
var
  rBezier1, rBezier2 : Reference;          // Указатели на геометрические объекты
  i,                                       // Счетчик цикла
  count    : Integer;                      // Количество пересечений
  xp, yp   : packed array[1..2] of Double; // Массивы точек пересечения
  buf      : AnsiString;                       // Буфер для сообщения
begin
  Bezier(0, 0);           // Создание кривой Безье
    Point(20,  0, 0);     // Точки входящие в кривую Безье
    Point(10, 20, 0);
    Point(20, 40, 0);
    Point(30, 20, 0);
    Point(20,  0, 0);
  rBezier1 := EndObj;

  Mtr( 0, 10, 0, 1 );     // Матрица преобразования координат ( 10 по оси OY )
    Bezier( 0, 0 );
      Point( 0,  10, 0 ); // Точки входящие в кривую Безье
      Point( 10, 20, 0 );
      Point( 20, 10, 0 );
      Point( 10, 0,  0 );
      Point( 0,  10, 0 );
    rBezier2 := EndObj();
  DeleteMtr();            // Отключение матрицы преобразования координат

  // Пересечение 2-х кривых, могут быть геометрические объекты: отрезки,
  // окружности, дуги, эллипсы, кривые, контуры, эквидистанты
  IntersectCurvCurv( rBezier1, // Указатели на геометрические объекты
                     rBezier2,
                     count,    // Количество точек пересечения
                     @xp, @yp, // Массивы точек пересечения
                     2 );      // Максимальное число выдаваемых точек пересечений

  // Результат пересечения
  buf := Format('count=%d', [count]);
  ksMessage(PAnsiChar(buf));

  for i := 1 to count do
  begin
    // Отрисовка точек пересечения
    Point(xp[i], yp[i], 2);
    buf := Format('xp[%d]=%4.2f yp[%d]=%4.2f', [i, xp[i], i, yp[i]]);
    ksMessage(PAnsiChar(buf));
  end;

end;


//----------------------------------------------------------------------------------------
// пересечь отрезок и дугу
//---
procedure IntersectLineSegArc;
var
  i, count : Integer; // Количество пересечений
  xp, yp   : Double2; // Массивы точек пересечения
  buf      : AnsiString;
  a1,a2    : Double;  // Начальный и конечный угол дуги
begin
  //построим отрезок
  LineSeg( 0, 40, 100, 40, 1);
  //построим дугу по цетру срадиусом и двум точкам
  ArcByPoint( 50, 40, 20, 30, 40, 70, 40, 1, 1 );

  a1 := Angle( 50, 40, 30, 40 );  // Начальный и конечный угол дуги
  a2 := Angle( 50, 40, 70, 40 );

  IntersectLinSArc( 0, 40,        // Первая точка отрезка
                    100, 40,      // Вторая точка отрезка
                    50, 40,       // Центр дуги
                    20,           // Радиус дуги
                    a1, a2,       // Начальный и конечный угол дуги
                    1,            // Направление дуги
                    count, xp, yp );

  // Отрисовка точек пересечения
  for  i := 1 to  count do
    Point( xp[i], yp[i], 0 );

  // Результат пересечения
  buf := Format('count=%d xp[1]=%4.2f yp[1]=%4.2f xp[2]=%4.2f yp[2]=%4.2f',
                 [ count, xp[1], yp[1], xp[2], yp[2] ]);
  ksMessage( PAnsiChar(buf) );

end;

//----------------------------------------------------------------------------------------
// касательная из точки
//---
procedure TanLinePointAndCircle;
var
  i, count : Integer; // Число касательных
  xp, yp   : Double2; // Массивы точек касания
  buf      : AnsiString;
begin

  Point ( 10, 50, 3);      //точка
  Circle( 50, 10, 40, 1 ); //окружность

  // Получить точки касания окружности и прямой, проходящей через заданную точку
  TanLinePointCircle( 10, 50,     // Координаты внешней точки
                      50, 10, 40, // Координаты центра и радиус окружности
                      count,      //количество точек касания
                      xp, yp );   //массивы точек касания

  // Отрисовка точек касания и касательных
  for  i := 1 to  count do
  begin
    Point( xp[i], yp[i], 0 );
    Line( 10, 50, Angle( 10, 50, xp[i], yp[i] ) );
  end;

  // Результат касания
  buf := Format('count=%d xp[1]=%4.2f yp[1]=%4.2f xp[2]=%4.2f yp[2]=%4.2f',
                 [ count,xp[1],yp[1],xp[2],yp[2] ]);
  ksMessage( PAnsiChar(buf) );
end;

//----------------------------------------------------------------------------------------
// касательная под углом
//---
procedure TanLineCircle;
var
  i      : Integer;
  xp, yp : Double2;
  buf    : AnsiString;

begin

  // Отрисовка окружности
  Circle( 50, 10, 40, 1 );

  // Получить точки касания окружности и прямой, проходящей под заданным углом
  TanLineAngCircle( 50, 10,            //центр окружности
                    40,                //радиус окружности
                    -45,               //угол наклона прямой
                    xp, yp );          //массивы точек касания

  // Отрисовка точки касания и касательной
  for i:= 1 to 2 do
  begin
    Point(xp[i],yp[i],1);
    Line(xp[i],yp[i], -45 );
  end;

  // Результат касания
  buf := Format('xp[1]=%4.2f yp[1]=%4.2f xp[2]=%4.2f yp[2]=%4.2f',
                 [ xp[1], yp[1], xp[2], yp[2] ]);
  ksMessage( PAnsiChar(buf) );

end;

//----------------------------------------------------------------------------------------
// поворот точки
//---
procedure RotatePoint;
var
  x, y  : Double; // Результат поворота точки
  buf   : AnsiString;

begin
  // Отрисовка точки
  Point( 60, 50, 0 );

  // Отрисовка точки в центре перемещения
  Point( 50, 50, 1 );

  Rotate( 60, 50,       //координаты точки
          50, 50,       //координаты центра
          180,          //угол поворота
          x, y );       //результат

  // Отрисовка результирующей точки
  Point( x, y, 2 );

  // Результат поворота
  buf := Format('x=%4.2f y=%4.2f', [ x, y ]);
  ksMessage( PAnsiChar(buf) );

end;

//----------------------------------------------------------------------------------------
// симметрия точки
//---
procedure SymmetryPoint;
var
  x, y : Double; // Результат симметрии точки
  buf  : AnsiString;

begin

  // Отрисовка точки
  Point( 55, 60, 0 );

  // Отрисовка отрезка
  LineSeg( 60, 50, 50, 50, 1 );

  Symmetry( 55, 60,   //координаты точки
            60, 50,   //координаты первой точки оси
            50, 50,   //координаты второй точки оси
            x, y );   //результат

  // Отрисовка результирующей точки
  Point( x, y, 1 );

  // Результат симметрии
  buf := Format('x=%4.2f y=%4.2f', [ x, y ]);
  ksMessage( PAnsiChar(buf) );

end;

//----------------------------------------------------------------------------------------
// сопрягающие окружности к двум прямым
//---
procedure Couplin2Lines;
var
  i, count : Integer; // Число сопряжений
  con      : CON4;    // Массив данных по каждому сопряжению ( структура CON включает:
                      // центр сопрягающей окружности, координаты точки сопряжения )
  rad      : Double;  // Радиус сопряжения
  buf      : AnsiString;
begin
  rad := 20;

  // Отрисовка прямых
  Line( 100, 100, 45 );
  Line( 100, 100, -45 );

  CouplingLineLine( 100, 100,  45, //первая прямая
                    100, 100, -45, //вторая прямая
                    rad,           // Радиус сопряжения
                    count,         // Число сопряжений
                    con );         // Массив данных по каждому сопряжению

  for i := 1 to  4 do
  begin
    Circle( con[i].xc, con[i].yc, rad, 2 );
    Point ( con[i].x1, con[i].y1, i );
    Point ( con[i].x2, con[i].y2, i );
  end;

  // Результат сопряжения
  buf := Format( 'count = %d, con[1].x1 = %4.2f, con[1].y1 = %4.2f,' + #13#10 + 'con[1].x2 = %4.2f, con[1].y2 = %4.2f',
                  [count, (con[1].x1), con[1].y1, con[1].x2, con[1].y2] );
  ksMessage( PAnsiChar(buf) );
end;

//----------------------------------------------------------------------------------------
// перепендикуляр
//---
procedure BuildPerpendicular;
var
  x, y  : Double; // Точка пересечения отрезка и перпендикуляра
  buf   : AnsiString;
begin

// Отрисовка точки
  Point( 50, 50, 0 );

  // Отрисовка отрезка
  LineSeg( 60, 10, 100, 10, 1 );

  // Координаты точки пересечения отрезка и перпендикуляра
  Perpendicular ( 50, 50,  //координаты произвольной точки
                  60, 10,  //координаты первой точки
                  100, 10, //координаты второй точки
                  x, y );  //координаты точки проекции

  // Отрисовка точки пересечения отрезка и перпендикуляра
  Point( x, y, 1 );

  // Результат расчета перпендикуляра
  buf := Format('x=%4.2f y=%4.2f', [ x, y ]);
  ksMessage( PAnsiChar(buf) );

end;

end.
