//////////////////////////////////////////////////////////////////////////////// 
// 
// step3a.cpp - Объекты - a
// 
// 1.  Контур                            - WorkContour
// 2.  Технические требования            - TDemWork
// 3.  Стрелка вида                      - DrawViewPointer
// 4.  Работа со штампом                 - WorkStamp
// 5.  Таблица                           - TableWork
// 6.  Эквидистанта                      - DrawEquidistant
// 7.  Эллипс                            - DrawEllipse
// 8.  Полилиния                         - DrawPolyline
// 9.  Nurbs                             - DrawNurbs
// 10. Допуск формы                      - WorkTolerance
// 11. Одинаковая шероховатость          - DrawSpecRough
// 12. Вставка фрагмента внешней ссылкой - DrawInsFragment1
// 13. Вставка локального фрагмента      - DrawInsFragment2
// 
//////////////////////////////////////////////////////////////////////////////// 
#include <vcl.h>
#pragma hdrstop

#include <tchar.h>


#ifndef __LIBTOOL_H
#include "libtool.h"
#endif

#ifndef __STEP3A_RH
#include "step3a.rh"
#endif 

//------------------------------------------------------------------------------
// в Win32 линкуется SDK/lib/kAPI2D5bc.lib
// в x64 линкуется SDK/lib64/kAPI2D5bc.a
// ---
#pragma comment(lib, "kAPI2D5bc")

//-------------------------------------------------------------------------------
// Задать идентификатор ресурсов
// ---
extern "C" unsigned int __export __stdcall LIBRARYID()
{
  return IDR_LIBID;
}


//-------------------------------------------------------------------------------
// Описания используемых функций
// ---
void WorkContour();
void TDemWork();
void TableWork();
void DrawViewPointer();
void WorkStamp();
void WorkTolerance();
void DrawEquidistant();
void DrawEllipse();
void DrawPolyline();
void DrawNurbs();
void DrawInsFragment1();
void DrawInsFragment2();
void DrawSpecRough();


//-------------------------------------------------------------------------------
// Головная функция библиотеки
// ---
extern "C" void __export __stdcall LIBRARYENTRY( unsigned int comm )
{
  if ( ksGetCurrentDocument( 1 ) )
  {
    switch ( comm )
    {
      case 1  : WorkContour();      break; // Контур
      case 2  : TDemWork();         break; // Технические требования
      case 3  : DrawViewPointer();  break; // Стрелка вида
      case 4  : WorkStamp();        break; // Работа со штампом
      case 5  : TableWork();        break; // Таблица
      case 6  : DrawEquidistant();  break; // Эквидистанта
      case 7  : DrawEllipse();      break; // Эллипс
      case 8  : DrawPolyline();     break; // Полилиния
      case 9  : DrawNurbs();        break; // Nurbs
      case 10 : WorkTolerance();    break; // Допуск формы
      case 11 : DrawSpecRough();    break; // Одинаковая шероховатость
      case 12 : DrawInsFragment1(); break; // Вставка фрагмента внешней ссылкой
      case 13 : DrawInsFragment2(); break; // Вставка локального фрагмента
    }
  }
  else
		MessageT( _T("Документ не активизирован или\nне является листом/фрагментом") );
}


//-------------------------------------------------------------------------------
// Построить контур
// ---
void WorkContour()
{
  Contour( 1 );  // Задание контура, style -	стиль линии ( 1 - основная, 2 - тонкая,
                 // 3 - осевая, 4 - штриховая,  5 - волнистая, 6 - утолщенная,
                 // 7 - штрихпунктирная с двумя точками,  8 - осевая основная,
                 // 9 - штриховая основная, 10 - осевая толстая,
                 // 11 - тонкая, включаемая в штриховку )
    LineSeg( 20, 30, 50, 30, 1 );
    ArcByPoint( 50, 20, 10, 50, 30, 50, 10, -1, 1 );
    // Вложенный контур
    Contour( 2 );
      LineSeg( 50, 10, 20, 10, 1 );
      ArcByPoint( 20, 20, 10, 20, 10, 20, 30, -1, 1 );
    EndObj();
  reference rContour = EndObj(); // Функция EndObj возвращает указатель на созданный объект контур
  
  // Подсветить контур
	LightObj( rContour, 1 );
	MessageT( _T("Снять выделение контура") );
  // Снять выделение контура 
  LightObj( rContour, 0 );
  
  // Создание группы объектов, type - тип группы ( 0 - определяет модельный, 1 - временный )
  reference g = NewGroup( 0 );
  EndGroup(); // Завершить создание группы объектов
  
  // Добавить новый объект в группу
  AddObjGroup( g, rContour );
  MoveObj( g, 10, 10 ); // Сдвинуть группу на 10 по оси OX, на 10 по оси OY
}


//-------------------------------------------------------------------------------
// Заполнение технических требований
// ---
void TDemWork()
{
  // Динамический массив габаритных прямоугольников
  reference pArRect = CreateArray( RECT_ARR, 0 ) ;
  
  // Поместим техтребования в двух габаритных окнах
  
  RectParam par; // Структура параметров прямоугольника по диагональным точкам
  
  // Заполним структуру параметров прямоугольника
  par.pBot.x = 230; // Параметры левой нижней точки прямоугольника
  par.pBot.y = 65;
  par.pTop.x = 415; // Параметры правой верхней точки прямоугольника
  par.pTop.y = 80;
  // Добавим прямоугольник в массив, элемент добавляется в конец массива
  AddArrayItem( pArRect, -1, &par, sizeof( par ) );
  par.pBot.x = 45;  // Параметры левой нижней точки прямоугольника
  par.pBot.y = 15;
  par.pTop.x = 230; // Параметры правой верхней точки прямоугольника
  par.pTop.y = 60;
  // Добавим прямоугольник в массив, элемент добавляется в конец массива
  AddArrayItem( pArRect, -1, &par, sizeof( par ) );
 
  // Открыть технические требования
  OpenTechnicalDemand( pArRect, 0 ); // Динамический массив габаритных прямоугольников, если 0,
                                     // то технические требования размещаются на одной странице автоматически
    // Задание подстроки технических требований
		TextLineT( NEW_LINE,    // Значения свойств, устанавливаемые двоичными флагами
							0,           // Тип свойства
							0,           // Указатель на значение свойства
							_T("1111111") ); // Строка
		TextLineT( NEW_LINE, 0, 0, _T("2222222") );
		TextLineT( NEW_LINE, 0, 0, _T("3333333") );
		TextLineT( NEW_LINE, 0, 0, _T("4444444") );
		TextLineT( NEW_LINE, 0, 0, _T("5555555") );
		TextLineT( NEW_LINE, 0, 0, _T("6666666") );
  // Закрыть технические требования
  reference rTechnicalDemand = CloseTechnicalDemand(); 
 
	MessageT( _T("Удалим технические требования") );
  // Удалим технические требования
  DeleteObj( rTechnicalDemand );

/*
  // Пример заполнения техтребований  в стиле 4-ой версии
  create_tdem(20, 0, 0 ,20, 0,0, 27,0,0,27,0,0);

    string_obj("111$d2&4522;33&463$1111111111");
    string_obj("2222&46222222222");
    string_obj("33$333;3333$3333");
    string_obj("4444444444444");
		string_obj("5555555555555");
      
  close_tdem();
*/ 
  
}


//-------------------------------------------------------------------------------
// Создание таблицы
// ---
void TableWork()
{
  Table(); // Определение таблицы, возвращает указатель на графический объект таблица
    // Разлиновка таблицы
    LineSeg( 50, 50, 90, 50, 1 ); 
    LineSeg( 50, 40, 90, 40, 1 );
    LineSeg( 50, 30, 90, 30, 1 );
    LineSeg( 50, 50, 50, 30, 1 );
    LineSeg( 70, 50, 70, 30, 1 );
    LineSeg( 90, 50, 90, 30, 1 );

		TextT( 52, 48, 0, 5, 1,0,_T("1") );
		TextT( 72, 48, 0, 5, 1,0,_T("2") );
		TextT( 52, 38, 0, 5, 1,0,_T("3") );
		TextT( 72, 38, 0, 5, 1,0,_T("4") );
    // Первая ячейка по точке привязки
/*  Text( 52, 48,            // Точка привязки
          0,                 // Угол наклона строки
          5,                 // Высота текста
          1,                 // Сужение символов
          0,                 // Значения свойств, устанавливаемые двоичными флагами 
          "Простой текст" ); // Строка
    // Вторая ячейка
    
    ParagraphParam parParagraph; // Структура параметров параграфа

    // Задать параметры параграфа
    parParagraph.style   = 0;  // Номер стиля текста (0 - стиль по умолчанию,
                               // 1 - обычный текст, 2 - текст для технических требований,
                               // 3 - текст размерной надписи, 4 - текст в обозначении шероховатости,
                               // 5 - текст на позиционной линии-выноске, 6 - текст над\под полкой линии-выноски,
                               // 7 - текст на ответвлении линии-выноски, 8 - текст в обозначении допуска формы,
                               // 9 - текст для заголовка таблицы, 10 - текст для ячейки таблицы,
                               // 11 - текст для линии разреза, 12 - текст для стрелки направления взгляда,
                               // 13 - текст в обозначении неуказанной шероховатости,
                               // 14 - текст в обозначении изменения )
    parParagraph.x       = 72; // Координаты точки привязки текста
    parParagraph.y       = 48; 
    parParagraph.ang     = 0;  // Угол наклона текста
    parParagraph.hFormat = 0;  // Признак горизонтального форматирования ( 0 - нет форматирования,
                               // 1 - сужение текста, 2 - перенос на другую строку )
    parParagraph.vFormat = 0;  // признак вертикального форматирования ( 0 - нет форматирования,
                               // 1-изменение шага строк )
    parParagraph.height  = 20; // Высота блока форматирования
    parParagraph.width   = 20; // Ширина блока форматирования
  
    // Параграфом называется автоматически форматируемый блок текста
    Paragraph( &parParagraph );
      // Задание подстроки параграфа текста
			TextLineT( NEW_LINE,    // Значения свойств, устанавливаемые двоичными флагами
                0,           // Тип свойства
                0,           // Указатель на значение свойства
								_T("Сложный") ); // Строка
			TextLineT( NEW_LINE|BOLD_ON, 0, 0,_T(" структурированный") );
			TextLineT( NEW_LINE|BOLD_OFF | ITALIC_ON, 0, 0, _T(" текст") );
    // Описание параграфа заканчивается функцией EndObj
    EndObj(); 
*/  // Описание таблицы заканчивается функцией EndObj  
  EndObj();
}


//-------------------------------------------------------------------------------
// Создание стрелки вида
// ---
void DrawViewPointer()
{
	ViewPointerParamT parViewPointer; // Структура параметров стрелки направления взгляда
  
  parViewPointer.style = 0;	 // Номер стиля текста (0 - стиль по умолчанию,
                             // 1 - обычный текст, 2 - текст для технических требований,
                             // 3 - текст размерной надписи, 4 - текст в обозначении шероховатости,
                             // 5 - текст на позиционной линии-выноске, 6 - текст над\под полкой линии-выноски,
                             // 7 - текст на ответвлении линии-выноски, 8 - текст в обозначении допуска формы,
                             // 9 - текст для заголовка таблицы, 10 - текст для ячейки таблицы,
                             // 11 - текст для линии разреза, 12 - текст для стрелки направления взгляда,
                             // 13 - текст в обозначении неуказанной шероховатости,
                             // 14 - текст в обозначении изменения )
  parViewPointer.x1    = 55; // Координаты вершины стрелки ( острие )
  parViewPointer.y1    = 50; 
  parViewPointer.x2    = 40; // Координаты конечной точки стрелки
  parViewPointer.y2    = 50; 
  parViewPointer.xt    = 40; // Координаты текста
  parViewPointer.yt    = 52;
  parViewPointer.type	 = 0;  // Способ задания надписи на линии ( 0 - текст в виде строки,
                             // 1 - динамический массив компонент текста )
	_tcscpy( parViewPointer.str, _T("A") ); // Надпись
 
  // Создание стрелки направления взгляда
	reference rViewPointer = ViewPointerT( &parViewPointer );
  
  // Подсветить стрелку
  LightObj( rViewPointer, 1 );
	MessageT( _T("Снять выделение стрелки") );
  // Снять выделение стрелки 
  LightObj( rViewPointer, 0 );  
}


//-------------------------------------------------------------------------------
// Заполнение основной надписи
// ---
void WorkStamp()
{
  OpenStamp(); // Открыть штамп чертежа/текстового документа
    ColumnNumber( 2 ); // Определить номер графы штампа, определяет графу с номером как текущую
    // Задание подстроки основной надписи
		TextLineT( NEW_LINE,    // Значения свойств, устанавливаемые двоичными флагами
							0,           // Тип свойства
							0,           // Указатель на значение свойства
							_T("1111111") ); // Строка
  CloseStamp(); // Закрыть штамп чертежа/текстового документа
}


//-------------------------------------------------------------------------------
// Допуск формы
// ---
void WorkTolerance()
{
  ToleranceParam parTolerance; // Структура параметров обозначения допуска формы и расположения поверхностей  
  MathPointParam parPoint;     // Структура параметров математической точки
 
  // Заполняем параметры 1-ой опоры
  // Создать массив для хранения точек 1-ой опоры
  parTolerance.branch1.pMathPoint = CreateArray( POINT_ARR,  0 );
  parTolerance.branch1.arrowType  = 2; // Тип опоры ( 0 - нет опоры, 1 - треугольник, 2 - стрелка )
  parTolerance.branch1.tCorner    = 1; // Число от 1 до 8, определяющее точку выхода "опоры" из таблицы
  
  // Координаты точки опоры
  parPoint.x = 40; 
  parPoint.y = 10;
  // Добавим точку опоры в массив, элемент добавляется в конец массива
  AddArrayItem( parTolerance.branch1.pMathPoint, -1, &parPoint, sizeof( parPoint ) );
  
  // Заполняем параметры 2-ой опоры
  // Создать массив для хранения точек 2-ой опоры
  parTolerance.branch2.pMathPoint = CreateArray( POINT_ARR,  0 );
  parTolerance.branch2.arrowType  = 1; // Тип опоры ( 0 - нет опоры, 1 - треугольник, 2 - стрелка )
  parTolerance.branch2.tCorner    = 5; // Число от 1 до 8, определяющее точку выхода "опоры" из таблицы
  
  // Координаты первой точки опоры
  parPoint.x = 100; 
  parPoint.y = 50;   
  // Добавим 1-ю точку опоры в массив, элемент добавляется в конец массива
  AddArrayItem( parTolerance.branch2.pMathPoint, -1, &parPoint, sizeof( parPoint ) );  
  
  // Координаты второй точки опоры
  parPoint.x = 100; 
  parPoint.y = 10;  
  // Добавим 2-ю точку опоры в массив, элемент добавляется в конец массива
  AddArrayItem( parTolerance.branch2.pMathPoint, -1, &parPoint, sizeof( parPoint ) );
 
  // Координаты базовой точки
  parTolerance.x    = 40; 
  parTolerance.y    = 40; 
  parTolerance.type = 0;  // Ориентация таблицы допуска ( 0 - горизонтально, 1 - вертикально ) 
  // Создание обозначения допуска формы, состоящей из таблицы ( в общем случае 10х10 ) и двух опор 
  Tolerance( &parTolerance );
    // Определить номер графы штампа ( 1-я графа ) 
    ColumnNumber( 1 );
    // Задание подстроки графы штампа
    // Спецзнак  
    int symbol = 26;
		TextLineT( SPECIAL_SYMBOL, // Значения свойств, устанавливаемые двоичными флагами
							 SPECIAL,        // Тип свойства
							 &symbol,        // Указатель на значение свойства
							 _T("") );           // Строка
    
    // 2-я графа
    ColumnNumber( 2 );
		TextLineT ( NEW_LINE, 0, 0, _T("111") );
    
    // 3-я графа
    ColumnNumber( 3 );
		TextLineT ( NEW_LINE, 0, 0, _T("222") );
    
    // 11-я графа
    ColumnNumber( 11 );
    // Спецзнак 
    symbol = 23;
		TextLineT ( SPECIAL_SYMBOL, SPECIAL, &symbol, _T("") );
    
    // 12-я графа
    ColumnNumber( 12 );
		TextLineT( NEW_LINE, 0, 0, _T("333") );

		// 13-я графа
		ColumnNumber( 13 );
		TextLineT( NEW_LINE, 0, 0, _T("444") );
  reference rTolerance = EndObj(); // Функция EndObj возвращает указатель на созданный объект допуска формы 

  // Подсветить допуск формы
  LightObj( rTolerance, 1 );
	MessageT( _T("Снять выделение допуска формы") );
  // Снять выделение допуска формы 
  LightObj( rTolerance, 0 ); 
  
  DeleteArray( parTolerance.branch2.pMathPoint ); // Удалить динамический массив точек 2-ой опоры
  DeleteArray( parTolerance.branch1.pMathPoint ); // Удалить динамический массив точек 1-ой опоры
}


//-------------------------------------------------------------------------------
// Построить эквидистанту
// ---
void DrawEquidistant()
{
  EquidistantParam parEquidistant; // Структура параметров эквидистанты
  
  parEquidistant.side     = 2; // Признак, с какой стороны строить эквидистанту ( 0 - слева по направлению,
                               // 1 - справа по направлению, 2 - с двух сторон )
  parEquidistant.cutMode  = 0; // Тип обхода углов контура ( 0 - обход срезом, 1 - обход дугой )
  parEquidistant.degState = 0; // Флаг разрешения вырожденных сегментов эквидистанты ( 0 - вырожденные
                               // сегменты запрещены, 1 - вырожденные сегменты разрешены )
  parEquidistant.radRight = 5; // Радиус эквидистанты
  parEquidistant.radLeft  = 3; // Радиус эквидистанты
  parEquidistant.style    = 1; // Cтиль линии ( 1 - основная, 2 - тонкая, 3 - осевая, 4 - штриховая, 
                               // 5 - волнистая, 6 - утолщенная, 7 - штрихпунктирная с двумя точками, 
                               // 8 - осевая основная, 9 - штриховая основная, 10 - осевая толстая,
                               // 11 - тонкая, включаемая в штриховку )
 
  // Структура параметров запроса к системе
	RequestInfoT info;
  memset( &info, 0, sizeof( info ) );
  
  // Строка или идентификатор меню состава команд 
	info.prompt = _T("Укажите объект");
  
  // Координаты точки ввода
  double x, y;  
  
  // Интерактивный ввод точки или команды
  while( CursorExT( &info, &x, &y, 0, NULL ) )
  {
    // Найти ближайший к заданной точке объект вида
    parEquidistant.geoObj = FindObj( x, y,  // Координаты точки
                                     1e6 ); // Размер стороны квадрата-ловушки с центром в точке x,y
    // Проверить существование объекта
    if ( ExistObj( parEquidistant.geoObj ) )
    { 
      // Создание эквидистанты
      reference rEquidistant = Equidistant( &parEquidistant );
      
      // Подсветить эквидистанту
      LightObj( rEquidistant, 1 );
			MessageT( _T("Снять выделение эквидистанты") );
      // Снять выделение эквидистанты 
      LightObj( rEquidistant, 0 ); 
    }
    else
			ErrorT( _T("Объект не найден") );
  }
}


//-------------------------------------------------------------------------------
// Создать эллипс
// ---
void DrawEllipse()
{
  EllipseParam parEllipse; // Структура параметров эллипса

  parEllipse.xc    = 50; // Координаты центра эллипса
  parEllipse.yc    = 40; 
  parEllipse.a     = 20; // Длина полуосей эллипса
  parEllipse.b     = 10; 
  parEllipse.ang   = 0;  // Угол наклона оси а эллипса к оси X
  parEllipse.style = 1;  // Cтиль линии ( 1 - основная, 2 - тонкая, 3 - осевая, 4 - штриховая, 
                         // 5 - волнистая, 6 - утолщенная, 7 - штрихпунктирная с двумя точками, 
                         // 8 - осевая основная, 9 - штриховая основная, 10 - осевая толстая,
                         // 11 - тонкая, включаемая в штриховку )
  
  // Создание эллипса
  reference rEllipse = ksEllipse( &parEllipse );
  
  // Подсветить эллипс
  LightObj( rEllipse, 1 );
	MessageT( _T("Снять выделение эллипса") );
	// Снять выделение эллипса
  LightObj( rEllipse, 0 ); 
}


//-------------------------------------------------------------------------------
// Создание полилинии
// ---
void DrawPolyline()
{
  // Массив точек составляющих полилинии
  MathPointParam arPoint[] = { {10, 10}, {20, 20}, {30, 10}, {40, 20} }; 

  /*
  // Пример создания полилинии как составного объекта
  ksPolyline( 1 ); // Создание ломаной, style - cтиль линии ( 1 - основная,
  // 2 - тонкая, 3 - осевая, 4 - штриховая, 5 - волнистая, 6 - утолщенная,
  // 7 - штрихпунктирная с двумя точками, 8 - осевая основная, 9 - штриховая основная,
  // 10 - осевая толстая, 11 - тонкая, включаемая в штриховку )
  for ( int i = 0; i < 4; i++ )
    Point( arPoint[i].x, arPoint[i].y, 1 ); // Точки входящие в полилинию
  reference rPolyline = EndObj(); // Функция EndObj возвращает указатель на созданный объект полилинии 
  */
  
  // Пример создания полилинии одной функцией
  PolylineParam parPolyline; // Структура параметров ломаной линии
  
  // Создать массив для хранения точек полилинии
  parPolyline.pMathPoint = CreateArray( POINT_ARR,  0 );
  // Добавим точки в массив точек полилинии
  for ( int i = 0; i < 4; i++ )
    AddArrayItem( parPolyline.pMathPoint, -1, &arPoint[i], sizeof( arPoint[i] ) );
  parPolyline.style = 2; // Cтиль линии ( 1 - основная, 2 - тонкая, 3 - осевая, 4 - штриховая, 
                         // 5 - волнистая, 6 - утолщенная, 7 - штрихпунктирная с двумя точками, 
                         // 8 - осевая основная, 9 - штриховая основная, 10 - осевая толстая,
                         // 11 - тонкая, включаемая в штриховку )
  reference rPolyline = _ksPolyline( &parPolyline ); // Создание ломаной
  
  DeleteArray( parPolyline.pMathPoint );  
  
  // Подсветить полилинию
  LightObj( rPolyline, 1 );
	MessageT( _T("Снять выделение полилинии") );
  // Снять выделение полилинии 
  LightObj( rPolyline, 0 );  
}


//-------------------------------------------------------------------------------
// Создать Nurbs - сплайн
// ---
void DrawNurbs()
{
  // Структура параметров точки NURBS
  // struct NurbsPointParam 
  // {
  //   double x, y;   // Координаты базовой точки 
  //   double weight; // Вес точки (должен быть больше нуля)
  // };

  // Массив точек составляющих сплайн
  NurbsPointParam arPoint[] = { {0, 0, 1}, {20, 20, 1}, {50, 10, 1}, {70, 20, 1}, {100, 0, 1},  {50, -50, 1} };

  // Построить Nurbs сплайн как составной объект
  Nurbs( 3, 0, 1 );
  for ( int i = 0; i < 6; i++ )
    NurbsPoint( &arPoint[i] ); // Точки входящие в сплайн
  reference rNurbs = EndObj(); // Функция EndObj возвращает указатель на созданный объект сплайн 

  // Подсветить сплайн
  LightObj( rNurbs, 1 );
  MessageT( _T("Снять выделение сплайна") );
  // Снять выделение сплайна 
  LightObj( rNurbs, 0 );  
}


//-------------------------------------------------------------------------------
// Вставка внешнего фрагмента
// ---
void DrawInsFragment1()
{
	TCHAR file[255];
	if( ksChoiceFileT(_T("*.frw"), NULL, file, 255, 1) )
  {
		// Определить данные для вставки фрагмента
		reference rDefinitionFragment = FragmentDefinitionT( file,       // Имя файла фрагмента
																												_T("Fragment"), // Имя вставки
																												1 );        // Тип вставки ( 0 - взять
                                                                    // в документ, 1 - внешней ссылкой )
    PlacementParam parPlacement; // Параметры привязки
    
    parPlacement.xBase = 30; // Координаты базовой точки в системе координат вида
    parPlacement.yBase = 40;
    parPlacement.ang   = 45; // Угол поворота в системе координат вида
    parPlacement.scale = 2 ; // Масштаб
    
    // Вставить ссылку на фрагмент
    reference rInsertFragment = InsertFragment( rDefinitionFragment, // Указатель определения фрагмента
                                                0,                   // Тип размещения по слоям ( 0 - на свои слои 1 - в текущий слой )
                                                &parPlacement );     // Параметры привязки
      
    // Подсветить фрагмент
    LightObj( rInsertFragment, 1 );
    MessageT( _T("Снять выделение фрагмента") );
    // Снять выделение фрагмента 
    LightObj( rInsertFragment, 0 ); 
  }
}


//-------------------------------------------------------------------------------
// Вставка локального фрагмента
// ---
void DrawInsFragment2()
{
  // Определим локальный фрагмент
	LocalFragmentDefinitionT( _T("Local") ); // Начать определение локального фрагмента
    LineSeg( 0, 0, 10, 0, 1 );
    LineSeg( 0, 0, 0, 10, 1 );
    ArcByPoint( 0, 0, 10, 10, 0, 0, 10, -1, 1 );
  // Закончить определение локального фрагмента  
  // Функция возвращает указатель на определение фрагмента 
  reference rDefinitionFragment = CloseLocalFragmentDefinition(); 
 
  PlacementParam parPlacement; // Параметры привязки
  
  parPlacement.xBase = 30; // Координаты базовой точки в системе координат вида
  parPlacement.yBase = 40;
  parPlacement.ang   = 45; // Угол поворота в системе координат вида
  parPlacement.scale = 2 ; // Масштаб

  // Вставить ссылку на фрагмент
  reference rInsertFragment = InsertFragment( rDefinitionFragment, // Указатель на фрагмент
                                              0,                   // Тип размещения по слоям ( 0 - на свои слои 1 - в текущий слой )
                                              &parPlacement );     // Ппараметры привязки
  
  // Подсветить фрагмент
  LightObj( rInsertFragment, 1 );
	MessageT( _T("Снять выделение фрагмента") );
  // Снять выделение фрагмента 
  LightObj( rInsertFragment, 0 ); 
}


//-------------------------------------------------------------------------------
// Шероховатость
// ---
void DrawSpecRough()
{
  SpecRoughParamT param;
  param.style = 0;          // стиль текста
  param.sign  = 2;          // тип знака 0-вид обр-ки не устанавливается, 1- обр-ка удалением слоя материала, 2 -обр-ка без удаления слоя материала
  param.t     = 1;          // 1- есть знак в скобках 0 -нет
  _tcscpy( param.s, _T("Rz40") );

  // Задать шероховатость неуказанных поверхностей
	ksSpecRoughT( &param );
}