////////////////////////////////////////////////////////////////////////////////
//
// LibConverter.h - Пример конвертера
//
////////////////////////////////////////////////////////////////////////////////
#ifndef _LibConverter_H
#define _LibConverter_H

//------------------------------------------------------------------------------
// Вспомогательные функции
// ---
CString  LoadStr( int strID );                       // Загрузить строку из ресурса c конвертации
CString _LoadStr( int strID );                       // Загрузить строку из ресурса без конвертации
int      LibMessage( LPCTSTR str, int flags = MB_OK ); // Вывод сообщения
int      LibMessage( int strId, int flags = MB_OK ); // Вывод сообщения из ресурсов
CString  FindExt( LPCTSTR filename );           // Находит в строке расширение файла и возвращает его

#endif 
