////////////////////////////////////////////////////////////////////////////////
//
// step1.cpp - Самая простая библиотека на Borland C++ Builder
//
////////////////////////////////////////////////////////////////////////////////
#include <vcl.h>
#pragma hdrstop

#include <tchar.h>

#ifndef __LIBTOOL_H
#include <libtool.h>
#endif


//------------------------------------------------------------------------------
// в Win32 линкуется SDK/lib/kAPI2D5bc.lib
// в x64 линкуется SDK/lib64/kAPI2D5bc.a
// ---
#pragma comment(lib, "kAPI2D5bc")

//-------------------------------------------------------------------------------
// Определить имя библиотеки
// ---
extern "C" char * __declspec(dllexport) __stdcall LIBRARYNAME()
{
	return "Самая простая библиотека на (Borland C++ Builder)";
}


//-------------------------------------------------------------------------------
// Головная функция библиотеки
// ---
extern "C" void __export __stdcall LIBRARYENTRY( unsigned int )
{
  // Выдача сообщения пользователю
	MessageT( _T("ПРИВЕТ !!!") );
}



